# 2) Дано неотрицательное целое число. Найдите число десятков в его десятичной записи

number = int(input())
print (number // 10 % 10)